# Parameter Type Id Wall Join Vis Property

Source: https://www.revitapidocs.com/2026/863ccedc-7eb8-fbee-a3d7-e3466211f8be.htm

---

| Parameter Type Id Wall Join Vis Property |
| --- |

"Display"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId WallJoinVis { get; }
```

```
Public Shared ReadOnly Property WallJoinVis As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ WallJoinVis {
	ForgeTypeId^ get ();
}
```

```
static member WallJoinVis : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace